; domain
(define (domain wumpus_domain_a)
  (:requirements :strips :typing)
  (:types agent location object wumpus) ;; Definnig  types used  in domain
  (:predicates
    (adjacent ?square-1 - location ?square-2 - location) ;; Defining Adjacent Locations
    (pit ?square - location) ;; Indicates that a pit is present at a given location
    (at ?who - (either agent object wumpus) ?square - location) ;;  Specifies location of  agent, object  ot wumpus
    (have ?who - agent ?what - object) ;;  Indicates that agent has an object
    (dead ?who - wumpus) ;; Indicates  dead wumpus
    (wumpus-in ?square - location)
    (is-agent ?who - agent)
    (is-wumpus ?who - wumpus)
    (is-gold ?what - object)
    (is-arrow ?what - object)
  )
  ;;  DEFINIG ACTIONS
  (:action move
    :parameters (?who - agent ?from - location ?to - location)
    :precondition (and 
                    (is-agent ?who)
                    (at ?who ?from) 
                    (adjacent ?from ?to) 
                    (not (pit ?to)) 
                    (not (wumpus-in ?to)))
    :effect (and 
             (at ?who ?to) 
             (not (at ?who ?from)))
  )

  (:action take
    :parameters (?who - agent ?what - object ?where - location)
    :precondition (and 
                    (is-agent ?who)
                    (at ?who ?where) 
                    (at ?what ?where))
    :effect (and 
             (have ?who ?what) 
             (not (at ?what ?where)))
  )
;; Updated shoot action -
  (:action shoot
    :parameters (?who - agent ?where - location ?with-what - object ?victim - wumpus ?where-victim - location)
    :precondition (and 
                    (is-agent ?who)
                    (have ?who ?with-what) 
                    (is-arrow ?with-what) 
                    (at ?who ?where) 
                    (is-wumpus ?victim) 
                    (at ?victim ?where-victim) 
                    (adjacent ?where ?where-victim))
    :effect (and 
             (dead ?victim) 
             (not (wumpus-in ?where-victim))  ;; This tells the wumpus is no longer in the 'where-victim' place 
             (not (have ?who ?with-what))) ;; The agent no longer has the arrow
  )
)

; problem
(define (problem wumpus)
  (:domain wumpus_domain_a)
  (:objects
   john-wick - agent
   sq-1-1 sq-1-2 sq-1-3 sq-1-4
   sq-2-1 sq-2-2 sq-2-3 sq-2-4
   sq-3-1 sq-3-2 sq-3-3 sq-3-4
   sq-4-1 sq-4-2 sq-4-3 sq-4-4 - location
   the-gold - object
   the-arrow - object
   wumpus - wumpus)

  (:init
   ;; Vertical adjacencies notation: sq-{X-axis-coordinate}-{Y-axis-coordinate}
   (adjacent sq-1-1 sq-1-2) (adjacent sq-1-2 sq-1-1)
   (adjacent sq-1-2 sq-1-3) (adjacent sq-1-3 sq-1-2)
   (adjacent sq-1-3 sq-1-4) (adjacent sq-1-4 sq-1-3)
   (adjacent sq-2-1 sq-2-2) (adjacent sq-2-2 sq-2-1)
   (adjacent sq-2-2 sq-2-3) (adjacent sq-2-3 sq-2-2)
   (adjacent sq-2-3 sq-2-4) (adjacent sq-2-4 sq-2-3)
   (adjacent sq-3-1 sq-3-2) (adjacent sq-3-2 sq-3-1)
   (adjacent sq-3-2 sq-3-3) (adjacent sq-3-3 sq-3-2)
   (adjacent sq-3-3 sq-3-4) (adjacent sq-3-4 sq-3-3)
   (adjacent sq-4-1 sq-4-2) (adjacent sq-4-2 sq-4-1)
   (adjacent sq-4-2 sq-4-3) (adjacent sq-4-3 sq-4-2)
   (adjacent sq-4-3 sq-4-4) (adjacent sq-4-4 sq-4-3)
   
   ;; Horizontal adjacencies notation: sq-{X-axis-coordinate}-{Y-axis-coordinate}
   (adjacent sq-1-1 sq-2-1) (adjacent sq-2-1 sq-1-1)
   (adjacent sq-2-1 sq-3-1) (adjacent sq-3-1 sq-2-1)
   (adjacent sq-3-1 sq-4-1) (adjacent sq-4-1 sq-3-1)
   (adjacent sq-1-2 sq-2-2) (adjacent sq-2-2 sq-1-2)
   (adjacent sq-2-2 sq-3-2) (adjacent sq-3-2 sq-2-2)
   (adjacent sq-3-2 sq-4-2) (adjacent sq-4-2 sq-3-2)
   (adjacent sq-1-3 sq-2-3) (adjacent sq-2-3 sq-1-3)
   (adjacent sq-2-3 sq-3-3) (adjacent sq-3-3 sq-2-3)
   (adjacent sq-3-3 sq-4-3) (adjacent sq-4-3 sq-3-3)
   (adjacent sq-1-4 sq-2-4) (adjacent sq-2-4 sq-1-4)
   (adjacent sq-2-4 sq-3-4) (adjacent sq-3-4 sq-2-4)
   (adjacent sq-3-4 sq-4-4) (adjacent sq-4-4 sq-3-4)
   
   (at john-wick sq-1-1) ;; Agent starting position
   (at the-gold sq-3-3) ;; Gold's location
   (at wumpus sq-1-3)
   (have john-wick the-arrow) ;; Agent starts with the arrow
   (is-agent john-wick)
   (is-gold the-gold)
   (is-arrow the-arrow)
   (at the-arrow sq-1-1) ;; Arrow's initial location
  
   
   (pit sq-3-1) ;; Example of a pit
   (pit sq-4-4) ;; Example of a pit
   (pit sq-2-2) ;; Additional pit

   ;; Wumpus's location
   (is-wumpus wumpus)
   (wumpus-in sq-1-3))

  (:goal (and 
          (have john-wick the-gold) ;; Have the gold
          (at john-wick sq-1-1)     ;; At the starting square
          (dead wumpus)))            ;; Wumpus is dead
)

; plan
1. (move john-wick sq-1-1 sq-1-2)
   deleted: (at john-wick sq-1-1)
   added: (at john-wick sq-1-2)
   goals met: 0 of 3
2. (shoot john-wick sq-1-2 the-arrow wumpus sq-1-3)
   deleted: (wumpus-in sq-1-3) (have john-wick the-arrow)
   added: (dead wumpus)
   goals met: 1 of 3
3. (move john-wick sq-1-2 sq-1-3)
   deleted: (at john-wick sq-1-2)
   added: (at john-wick sq-1-3)
   goals met: 1 of 3
4. (move john-wick sq-1-3 sq-2-3)
   deleted: (at john-wick sq-1-3)
   added: (at john-wick sq-2-3)
   goals met: 1 of 3
5. (move john-wick sq-2-3 sq-3-3)
   deleted: (at john-wick sq-2-3)
   added: (at john-wick sq-3-3)
   goals met: 1 of 3
6. (take john-wick the-gold sq-3-3)
   deleted: (at the-gold sq-3-3)
   added: (have john-wick the-gold)
   goals met: 2 of 3
7. (move john-wick sq-3-3 sq-2-3)
   deleted: (at john-wick sq-3-3)
   added: (at john-wick sq-2-3)
   goals met: 2 of 3
8. (move john-wick sq-2-3 sq-1-3)
   deleted: (at john-wick sq-2-3)
   added: (at john-wick sq-1-3)
   goals met: 2 of 3
9. (move john-wick sq-1-3 sq-1-2)
   deleted: (at john-wick sq-1-3)
   added: (at john-wick sq-1-2)
   goals met: 2 of 3
10. (move john-wick sq-1-2 sq-1-1)
   deleted: (at john-wick sq-1-2)
   added: (at john-wick sq-1-1)
   goals met: 3 of 3
